# To install, run 
# brew bundle install --file=/path/to/Brewfile

# boilerplate
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# if I want to use mas in the future
# brew "mas"

# brew formulae
brew "ffmpeg"
brew "fzf"
brew "git"
brew "hub"
brew "jq"
brew "mosh"
brew "mpich"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "zplug"
brew "mono"
brew "go"
brew "nodejs"

# GUI MacOS Applications
cask "basictex"
cask "bibdesk"
cask "latexit"
cask "lyx"
cask "google-cloud-sdk"
# cask "miniconda"
cask "notion"
cask "openmpi"
cask "spotify"
cask "google-chrome"
cask "docker"
cask "iterm2"

 # if I want to use mas in the future
# mas "Slack", id: 803453959
